app/controllers/logradouros_controller.rb

SELECT "logradouros".* FROM "logradouros"
---
  def index
    @logradouros = Logradouro.all

SELECT  "logradouros".* FROM "logradouros" WHERE "logradouros"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_logradouro
      @logradouro = Logradouro.find(params[:id])